[
    {
        "address": "702 Sw 8Th St, Bentonville, AR 72716",
        "jobs": [
            {
                "jobLink": "https://careers.walmart.com/us/jobs/WD2134029-senior-manager-technology-operations-item-enablement",
                "title": "Senior Manager, Technology Operations, Item Enablement",
                "description": "Position Summary...\n\nWhat you'll do...\n\nWant to help drive the future of e Commerce at a Fortune 1 Company?\n\nThe Item Enablement team ensures customers can buy what they want how they want it, with a tech-powered, people-led approach that is helping to define the future of retail.This is a transformative opportunity leading the strategic management and delivery of key initiatives that support automated, sustainable processes, decisions and optimizations for what Walmart sells online.\n\nWhat youll do\n\nLead strategic initiatives to enhance Transactability and customer-facing availability in the e Commerce and Omnichannel space\nCollaborate with cross-functional stakeholders, understanding and applying principles of Walmarts strategy to manage Transactability\nLeverage data and modeling to derive insights, handle large datasets, and identify trends that inform business strategy and decision-making\nDevelop project plans and build business cases to pitch new ideas\nTranslate complex business problems into Transactability requirements, formulating sustainable processes with an eye towards automation\nCollaborate with Product, Data Science, and Engineering teams to execute strategic initiatives, solving next-generation retail problems via state-of-the-art solutions\n\nWhat youll bring\n\nAbility to thrive in ambiguity, applying structure and frameworks to accelerate end-to-end results\nStrong problem-solving skills, developing short-term, sustainable solutions to issues in real-time\nEffective storytelling capabilities, building and presenting audience-specific enterprise-level story arcs\nProactive leadership, demonstrating ability to lead and manage projects independently and as part of a team\nA data-driven mindset, utilizing data insights to inform strategic decisions and identify business opportunities\n\nQualifications\n\nBachelors degree in a quantitative field such as Engineering, Business Administration, or Operations Management\n5-8 years of experience in top-tier management consulting, corporate strategy, or similar roles\nExecutive-level storyboarding and communication skills, with excellent presentation abilities and interaction with both technical and non-technical stakeholders\nExperience in SQL and other data analysis tools, including visualization tools such as Tableau or Looker; familiarity with Python, R, and machine learning techniques for data analysis is preferred\n\nPreferred Qualifications\n\nMBA or other masters degree in a quantitative field.\nExperience in Retail, e Commerce, Merchandising Operations, or Digital Merchandising\nProduct management or technical experience, preferably at the intersection of Retail, e Commerce, Analytics ; Data Science\nDemonstrable supervisory experience or leadership capabilities\n\nPerks and Benefits\n\nBeyond competitive pay, you can receive incentive awards for your performance. Other great perks include 401(k) match, stock purchase plan, paid maternity and parental leave, PTO, multiple health plans, and much more.\n\nThe above information has been designed to indicate the general nature and level of work performed in the role. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job. The full Job Description can be made available as part of the hiring process.\n\nAbout Walmart Ecommerce\n\nWe are Walmart e Commerce - the team shaping the future of online shopping by defining the global online marketplace that influences millions of shoppers daily. We bring a passion and expertise that is unmatched, and our efforts have an epic impact on the world around us, both inside and outside of work. With colleagues across the nation, we strive to create a sense of belonging and embrace belonging in all forms, with no shortage of guidance and support for you as you grow and develop your career here. Discover the impact you can make at careers.walmart.com.\n\nWalmart, Inc. is an Equal Opportunity Employer By Choice. We believe we are best equipped to help our associates, customers and the communities we serve live better when we really know them. That means understanding, respecting and valuing unique styles, experiences, identities, ideas and opinions while being inclusive of all people.\n\nAt Walmart, we offer competitive pay as well as performance-based bonus awards and other great benefits for a happier mind, body, and wallet. Health benefits include medical, vision and dental coverage. Financial benefits include 401(k), stock purchase and company-paid life insurance. Paid time off benefits include PTO (including sick leave), parental leave, family care leave, bereavement, jury duty, and voting. Other benefits include short-term and long-term disability, company discounts, Military Leave Pay, adoption and surrogacy expense reimbursement, and more.\n\n‎ \n\n‎ \n\n‎ \n\nYou will also receive PTO and/or PPTO that can be used for vacation, sick leave, holidays, or other purposes. The amount you receive depends on your job classification and length of employment. It will meet or exceed the requirements of paid sick leave laws, where applicable.\n\n‎ \n\nFor information about PTO, see https://one.walmart.com/notices.\n\n‎ \n\n‎ \n\nLive Better U is a Walmart-paid education benefit program for full-time and part-time associates in Walmart and Sam's Club facilities. Programs range from high school completion to bachelor's degrees, including English Language Learning and short-form certificates. Tuition, books, and fees are completely paid for by Walmart.\n\n‎ \n\nEligibility requirements apply to some benefits and may depend on your job classification and length of employment. Benefits are subject to change and may be subject to a specific plan or program terms.\n\n‎ \n\nFor information about benefits and eligibility, see One.Walmart.\n\n‎ \n\nThe annual salary range for this position is $90,000.00-$180,000.00\n\n‎ \n\nAdditional compensation includes annual or quarterly performance bonuses.\n\n‎ \n\nAdditional compensation for certain positions may also include:\n\n‎ \n\n‎ \n\n- Stock\n\n‎ \n\n‎ \n\nMinimum Qualifications...\n\nOutlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications.\n\nOption 1: Bachelor's degree in computer science, management information systems, industrial engineering, engineering management, business,information systems, project/program management, information technology, finance, management, or related area and 5 years’ experience inproject management, program management, program operations, or related area.Option 2: 7 years’ experience in project management, program management, program operations, or related area.2 years’ supervisory experience.\n\nPreferred Qualifications...\n\nOutlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications.\n\nMaster’s degree in computer science, management information systems, industrial engineering, engineering management, business, information systems, project/program management, information technology, finance, management, or related area and 4 years' experience in project management, program management, program operations, or related area., We value candidates with a background in creating inclusive digital experiences, demonstrating knowledge in implementing Web Content Accessibility Guidelines (WCAG) 2.2 AA standards, assistive technologies, and integrating digital accessibility seamlessly. The ideal candidate would have knowledge of accessibility best practices and join us as we continue to create accessible products and services following Walmart’s accessibility standards and guidelines for supporting an inclusive culture.\n\nPrimary Location...\n\n702 Sw 8Th St, Bentonville, AR 72716, United States of America",
                "hourlyRate": null,
                "salary": "90,000.00-$180,000.00",
                "types": []
            },
            {
                "jobLink": "https://careers.walmart.com/us/jobs/WD2171347-senior-manager-specialty-compliance-and-ethics-item-policy-global-marketplace-and-ecommerce-compliance",
                "title": "Senior Manager, Specialty Compliance and Ethics - Item Policy, Global Marketplace and Ecommerce Compliance",
                "description": "Position Summary...\n\nWhat you'll do...\n\nWalmart’s Item Policy team in Global Marketplace and eCommerce Compliance is responsible for working with compliance, legal, and business teams to define, develop, and enforce policies and programs to ensure compliant products are sold on Walmart.com.\n\nThe Senior Manager role plays a critical part of the Item Policy team, by overseeing the building of compliance programs and managing the execution of programs.  The Senior Manager is also responsible for overseeing the governance of our marketplace prohibited products policy by drafting external-facing policies and internal guidance on prohibited and allowed items. This role will partner with various teams including Compliance, Legal, Merchandising, Operations, and Corporate Affairs.\n\nWhat you’ll do….\n\nHelp build compliance programs for Walmart’s ecommerce platform by working with subject matter experts, legal, and business teams.  \n\nManage associates responsible for the execution of ecommerce compliance programs.\n\nDraft policies and guidance materials to provide training and awareness about items prohibited from Walmart.com.\n\nSpot risks, gaps, and drive efficiencies in our programs. \n\nWhat you’ll bring….\n\nWork experience on Legal or Regulatory Compliance teams.\n\nStrong communication skills.\n\nStrong analytical skills.\n\nYou are action-oriented, resourceful, and work with initiative.\n\nYou are organized, disciplined, and can manage multiple tasks simultaneously.\n\nThe ability to work cross-functionally to build strong work relationships resulting in program improvements.\n\nThe above information has been designed to indicate the general nature and level of work performed in the role.  It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job. The full Job Description can be made available as part of the hiring process.\n\nBenefits & Perks\n\nBeyond competitive pay, you can receive incentive awards for your performance. Other great perks include 401(k) match, stock purchase plan, paid maternity and parental leave, PTO, multiple health plans, and much more. \n\nBelonging\n\nAt Walmart, our vision is \"everyone included.\" By fostering a workplace culture where everyone is—and feels—included, everyone wins. Approximately 90% of the U.S. population lives within 10 miles of a Walmart or Sam’s Club – our associates and customers reflect the makeup of all of America, as well as the 18 other countries where we operate. By making Walmart a welcoming place where all people feel like they belong, we’re able to engage associates, strengthen our business, improve our ability to serve customers, and support the communities where we operate. We aim to create a culture where every associate feels valued for who they are, rooted in respect for the individual.\n\nAt Walmart, we offer competitive pay as well as performance-based bonus awards and other great benefits for a happier mind, body, and wallet. Health benefits include medical, vision and dental coverage. Financial benefits include 401(k), stock purchase and company-paid life insurance. Paid time off benefits include PTO (including sick leave), parental leave, family care leave, bereavement, jury duty, and voting. Other benefits include short-term and long-term disability, company discounts, Military Leave Pay, adoption and surrogacy expense reimbursement, and more.\n\n‎ \n\n‎ \n\n‎ \n\nYou will also receive PTO and/or PPTO that can be used for vacation, sick leave, holidays, or other purposes. The amount you receive depends on your job classification and length of employment. It will meet or exceed the requirements of paid sick leave laws, where applicable.\n\n‎ \n\nFor information about PTO, see https://one.walmart.com/notices.\n\n‎ \n\n‎ \n\nLive Better U is a Walmart-paid education benefit program for full-time and part-time associates in Walmart and Sam's Club facilities. Programs range from high school completion to bachelor's degrees, including English Language Learning and short-form certificates. Tuition, books, and fees are completely paid for by Walmart.\n\n‎ \n\nEligibility requirements apply to some benefits and may depend on your job classification and length of employment. Benefits are subject to change and may be subject to a specific plan or program terms.\n\n‎ \n\nFor information about benefits and eligibility, see One.Walmart.\n\n‎ \n\nSan Bruno, California US-04398/Sunnyvale, California US-08479:The annual salary range for this position is $117,000.00-$234,000.00\n\n‎ \n\nBentonville, Arkansas US-09401:The annual salary range for this position is $90,000.00-$180,000.00\n\n‎ \n\n‎ \n\n‎ \n\n‎ \n\n‎ \n\n‎ \n\n‎ \n\n‎ \n\n‎ \n\n‎ \n\nAdditional compensation includes annual or quarterly performance bonuses.\n\n‎ \n\nAdditional compensation for certain positions may also include:\n\n‎ \n\n‎ \n\n- Stock\n\n‎ \n\n‎ \n\nMinimum Qualifications...\n\nOutlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications.\n\nMinimum Qualifications: Bachelor's degree in Business, Human Resources, or related field and 4 years’ experience in compliance, ethics, legal, project management, or related area OR 6 years’ experience in compliance, ethics, legal, project management, or related area. 2 years’ supervisory experience. 3 years’ experience using intermediate functionality of Microsoft Office.\n\nPreferred Qualifications...\n\nOutlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications.\n\nMasters: Business Administration\n\nProject Management - Project Management Professional - Certification\nPrimary Location...\n\n702 Sw 8Th St, Bentonville, AR 72716, United States of America",
                "hourlyRate": null,
                "salary": "90,000.00-$180,000.00",
                "types": []
            }
        ]
    },
    {
        "address": "135 Fairgrounds Memorial Pkwy, Ithaca, NY 14850-5362",
        "jobs": [
            {
                "jobLink": "https://careers.walmart.com/us/jobs/WD2171630-usa-coach-ops-mgr-trainee",
                "title": "(USA) Coach/Ops Mgr Trainee",
                "description": "Position Summary...\n\nWhat you'll do...\nLeads and develops teams effectively by teaching training and actively listening to associates touring stores and providing feedback Tourto Teach communicating and collaborating with all levels of associates regarding store operations utilizing technology business initiativesmerchandising and company direction introducing and leading company change efforts providing clear expectations and guidance to implementbusiness solutions and communicating business objectives to teams effectively Models and demonstrates exceptional customer service standards to store associates by following and demonstrating the One Best Way OBWservice model managing and supporting customer service initiatives for example store of the community and community outreach programsensuring customer needs complaints and issues are successfully resolved developing and implementing action plans to correct deficiencies andproviding process improvement leadership to ensure a high quality customer experience Drives the financial performance and sales of the designated store area by reviewing and evaluating PL Profit Loss statements managing andassisting in budgeting forecasting and controlling expenses in designated business area to confirm they are indexed to sales monitoring andensuring effective merchandise presentation seasonal transitions inventory flow and operational processes and developing and implementingaction plans to mitigate shrink and ensure sales and profit goals are achieved for business area Provides supervision and development opportunities for hourly associates by hiring training and mentoring of associates assigning duties settingclear expectations providing associate recognition communicating expectations consistently and effectively ensuring culture of belongingawareness and recruiting and developing qualified associates to meet staffing needs and achieve company growth potential Coordinates completes and oversees jobrelated activities and assignments by developing and maintaining relationships with key stakeholderssupporting plans and initiatives to meet customer and business needs identifying and communicating goals and objectives building accountability forand measuring progress in achieving results identifying and addressing improvement opportunities and demonstrating adaptability and promotingcontinuous learning Provides supervision and development opportunities for associates by hiring and training mentoring assigning duties providing recognition andensuring belonging awareness Ensures compliance with company policies and procedures and supports company mission values and standards of ethics and integrity byimplementing related action plans utilizing and supporting the Open Door Policy and providing direction and guidance on applying these in executingbusiness processes and practices Respect the Individual: Builds highperforming teams embraces differences in people cultures ideas and experiences creates a workplace where associates feel seen supported and connected through a culture of belonging creates opportunitiesfor all associatesto thrive and performx000B Respect the Individual: Works collaboratively builds strong and trusting relationships communicates with impact energy and positivity to motivate and influencex000B Respect the Individual: Attracts and retains the best talent empowers and develops talent and recognizes others contributions and accomplishments Act with Integrity:Maintains and promotes the highest standards of integrity ethics and compliance models the Walmart values to support and foster our culture holds oneself and others accountable supports Walmarts goal of becoming a regenerative company by making a positive impact for associates customers members and the world around useg creating a sense of belonging eliminating waste participating in local giving Act with Integrity:Acts in a selfless manner and is consistently humble selfaware honest fair and transparent Serve Our Customers and Members Delivers results while putting the customer first considers and adapts to how where and when customers shop and applies the EDLP and EDLC business models to all plans Serve Our Customers and Members Makes decisions based on data insights and analysis balances short and longterm prioritiesand considers our customers fellow associates shareholders suppliers business partners and communities when making plans Strive for Excellence:Displays curiosity and a desire to learn takes calculated risks demonstrates courage and resilience and encourages learning from mistakes Strive for Excellence:Drives continuous improvements adopts and encourages the use of newtechnologies and skills and supports others through change\n\nAt Walmart, we offer competitive pay as well as performance-based bonus awards and other great benefits for a happier mind, body, and wallet. Health benefits include medical, vision and dental coverage. Financial benefits include 401(k), stock purchase and company-paid life insurance. Paid time off benefits include PTO (including sick leave), parental leave, family care leave, bereavement, jury duty, and voting. Other benefits include short-term and long-term disability, company discounts, Military Leave Pay, adoption and surrogacy expense reimbursement, and more.\n\n‎ \n\n‎ \n\n‎ \n\nYou will also receive PTO and/or PPTO that can be used for vacation, sick leave, holidays, or other purposes. The amount you receive depends on your job classification and length of employment. It will meet or exceed the requirements of paid sick leave laws, where applicable.\n\n‎ \n\nFor information about PTO, see https://one.walmart.com/notices.\n\n‎ \n\n‎ \n\nLive Better U is a Walmart-paid education benefit program for full-time and part-time associates in Walmart and Sam's Club facilities. Programs range from high school completion to bachelor's degrees, including English Language Learning and short-form certificates. Tuition, books, and fees are completely paid for by Walmart.\n\n‎ \n\nEligibility requirements apply to some benefits and may depend on your job classification and length of employment. Benefits are subject to change and may be subject to a specific plan or program terms.\n\n‎ \n\nFor information about benefits and eligibility, see One.Walmart.\n\n‎ \n\nThe hourly wage range for this position is $31.25-$38.46* Plus Differential to meet legislative requirements, where applicable.\n\n‎ \n\n*The actual hourly rate will equal or exceed the required minimum wage applicable to the job location.\n\n‎ \n\nAdditional compensation includes annual or quarterly performance bonuses.\n\n‎ \n\nAdditional compensation for certain positions may also include:\n\n‎ \n\n- Regional Pay Zone (RPZ) (based on location)\n\n‎ \n\n‎ \n\nMinimum Qualifications...\n\nOutlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications.\n\n2 years’ of college; OR 1 year’s retail experience and 1 year’s supervisory experience; OR 2 years’ general work experience and 1 year’s\nsupervisory experience.\nFor facilities that sell firearms, I acknowledge that the position for which I am applying will require successful completion of a firearms- specific\nCriminal Background Check (CBC) and Firearms Authorized Training.\nFor facilities that sell only ammunition and have state specific requirements, I acknowledge that the position for which I am applying may require a\ncurrent state issued Certificate of Eligibility.\nAssociates will be required to attend and successfully complete all job-required trainings and assessments (for example, Academy trainings, Open Door trainings, etc.)\n\nPreferred Qualifications...\n\nOutlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications.\n\nBachelor of Science in Business Management and Leadership through Live Better U and Bellevue University, Certificate of Completion in People and Business Leadership through Live Better U and Bellevue University, General work experience supervising 5 or more direct reports to include the responsibility of performance management, mentoring, hiring, and firing\n\nPrimary Location...\n\n135 Fairgrounds Memorial Pkwy, Ithaca, NY 14850-5362, United States of America",
                "hourlyRate": "31.25-$38.46* Plus Differential to meet legislative requirements, where applicable.",
                "salary": null,
                "types": []
            },
            {
                "jobLink": "https://careers.walmart.com/us/jobs/WD2076649-usa-optometrist-pre-grad-intern-walmart",
                "title": "(USA) Optometrist Pre-Grad Intern - Walmart",
                "description": "Position Summary...\n\nWhat you'll do...\n\nWhat you'll do...\n\nSupports Optical care and services to Customers by obtaining measurements, verifying, determining, and dispensing prescriptions; counseling, consulting with, and educating Customers; assisting with eyewear selection; and maintaining confidential information. Provides optical clinical care by diagnosing Customers to manage treatment of visual problems and ocular disease; providing effective patient education and counseling; and communicating with key stakeholders (for example, Optometrist, Clinic Staff) to increase understanding of optometric standards under the guidance of Associate Doctor of Optometry. Maintains the Optical area in accordance with Company policies and procedures by properly handling claims and returns, damages, ensuring optical operations are aligned with Company and regulatory standards (for example, HIPAA); and ensuring a safe work environment. Maintains merchandise presentation in the Optical area by stocking and rotating merchandise, removing damaged zoning the area, arranging and organizing merchandise/supplies, identifying shrink and or out-of-date goods, setting up, cleaning, and organizing product displays, signing and pricing merchandise appropriately, and securing fragile and high-shrink merchandise. Receives and stocks merchandise/supplies from distribution centers and suppliers and organizes and maintains the Optical Area by following Company procedures, utilizing equipment appropriately, merchandising, and completing and retaining required paperwork, logs, and other documentation. Sells Optical products and services by assisting Customers with purchasing decisions, measuring, adjusting, and repairing frames and lenses, completing eyewear/contact lens orders, identifying and verifying prescription information, completing and maintaining paperwork, forms, and other required documentation, collecting payments for doctor services, and performing and recording results of optometric pre-tests.\n\nLeadership Expectations Respect for the Individual: Embraces differences in people, cultures, ideas, and experiences; creates a workplace where associates feel seen, supported and connected through culture of belonging; creates unique opportunities for associates to thrive and perform; helps to attract the best, top talent.\n\nRespect for the Individual: Works as a team; builds strong and trusting relationships; communicates with impact, energy, and positivity to motivate and influence. Strengthens the team by helping, developing and mentoring others; recognizes others contributions and accomplishments.\n\nAct with Integrity: Maintains and promotes the highest standards of integrity, ethics and compliance, models the Walmart values to support and foster our culture; holds oneself and others accountable; supports Walmart’s goal of becoming a regenerative company by making a positive impact for associates, customers, members, and the world around us. Acts in a selfless manner and is consistently humble, self-aware, honest, fair, and transparent.\n\nService to the Customer/Member: Delivers results while putting the customer first. Makes decisions based reliable information; balances short- and long-term priorities; and considers how own work impacts the teams ability to deliver on our purpose for all stakeholders.\n\nStrive for Excellence: Displays curiosity and a desire to learn; takes calculated risks; and demonstrates courage and resilience. Drives continuous improvements; is open to and uses new technologies and skills; and supports others through change.\n\nAt Walmart, we offer competitive pay as well as performance-based bonus awards and other great benefits for a happier mind, body, and wallet. Health benefits include medical, vision and dental coverage. Financial benefits include 401(k), stock purchase and company-paid life insurance. Paid time off benefits include PTO (including sick leave), parental leave, family care leave, bereavement, jury duty, and voting. Other benefits include short-term and long-term disability, company discounts, Military Leave Pay, adoption and surrogacy expense reimbursement, and more.\n\n‎ \n\n‎ \n\n‎ \n\nYou will also receive PTO and/or PPTO that can be used for vacation, sick leave, holidays, or other purposes. The amount you receive depends on your job classification and length of employment. It will meet or exceed the requirements of paid sick leave laws, where applicable.\n\n‎ \n\nFor information about PTO, see https://one.walmart.com/notices.\n\n‎ \n\n‎ \n\nLive Better U is a Walmart-paid education benefit program for full-time and part-time associates in Walmart and Sam's Club facilities. Programs range from high school completion to bachelor's degrees, including English Language Learning and short-form certificates. Tuition, books, and fees are completely paid for by Walmart.\n\n‎ \n\nEligibility requirements apply to some benefits and may depend on your job classification and length of employment. Benefits are subject to change and may be subject to a specific plan or program terms.\n\n‎ \n\nFor information about benefits and eligibility, see One.Walmart.\n\n‎ \n\nThe hourly wage range for this position is $15.50-$32.00*\n\n‎ \n\n*The actual hourly rate will equal or exceed the required minimum wage applicable to the job location.\n\n‎ \n\nAdditional compensation includes annual or quarterly performance bonuses.\n\n‎ \n\nAdditional compensation for certain positions may also include:\n\n‎ \n\n- Regional Pay Zone (RPZ) (based on location)\n\n‎ \n\n‎ \n\nMinimum Qualifications...\n\nOutlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications.\n\nMinimum Qualifications: Enrolled in an accredited Optometry school.\n\nPreferred Qualifications...\n\nOutlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications.\n\nPrimary Location...\n\n135 Fairgrounds Memorial Pkwy, Ithaca, NY 14850-5362, United States of America",
                "hourlyRate": "15.50-$32.00*",
                "salary": null,
                "types": []
            }
        ]
    }
]